{
  "es": {
    "header": {
      "name": "Javier Herreros Rodríguez",
      "title": "Desarrollador Java Full-Stack",
      "location": "Albacete - España",
      "downloadCV": "Descargar CV"
    },
    "about": {
      "title": "Sobre mí",
      "description": "Desarrollador Java Full-Stack con sólida experiencia en el desarrollo y personalización de soluciones empresariales. He trabajado en la implementación y adaptación de aplicaciones críticas que optimizan procesos y mejoran la eficiencia. Especializado en Java (Spring Boot, JPA) y SQL (Oracle, SQL Server), con experiencia en tecnologías frontend (React, Angular). Comprometido con la implementación de arquitecturas limpias y la práctica de desarrollo impulsado por pruebas. Disfruto compartiendo mis conocimientos y apoyando a desarrolladores junior en su crecimiento profesional."
    },
    "skills": {
      "title": "Mis Habilidades",
      "list": [
        "Java",
        "Spring Boot",
        "JPA",
        "SQL (Oracle, SQL Server)",
        "React",
        "Angular",
        "Clean Architecture",
        "TDD",
        "Git",
        "Scrum",
        "Kanban",
        "XP",
        "Jenkins",
        "JBOSS",
        "JUnit",
        "Mockito",
        "REST",
        "SOAP"
      ]
    },
    "experience": {
      "title": "Experiencia Profesional",
      "jobs": [
        {
          "company": "NTT DATA Europe & Latam",
          "position": "Desarrollador Java Full-Stack",
          "period": "Abril 2024 - Presente",
          "description": "Desarrollador Java Full-Stack con experiencia en el diseño y desarrollo de soluciones tecnológicas para el sector público (Justicia). He participado en la implementación y adaptación de aplicaciones críticas que optimizan procesos judiciales, mejorando la eficiencia y la transparencia en la gestión de información.",
          "tasks": [
            "Análisis, diseño y desarrollo de funcionalidades personalizadas, asegurando la alineación con los requisitos del negocio.",
            "Análisis, desarrollo y mantenimiento de bases de datos (Oracle SQL, SQL Developer, PL/SQL, DBeaver).",
            "Resolución de incidencias y soporte técnico a usuarios finales, asegurando la estabilidad y disponibilidad de las aplicaciones (Jira).",
            "Apoyo a compañeros y desarrolladores juniors, promoviendo el aprendizaje y la colaboración dentro del equipo.",
            "Colaboración en equipos ágiles, participando activamente en todas las fases del desarrollo, desde la planificación hasta la entrega (Scrum, Kanban, XP).",
            "Uso de herramientas de gestión de tareas como Jira, Notion, Microsoft Teams y SharePoint para la coordinación y seguimiento de proyectos.",
            "Realización de pruebas unitarias y de integración para asegurar la calidad del software (JUnit, Mockito).",
            "Implantación y gestión del control de versiones, proporcionando formación a otros compañeros en el uso de Git, GitHub, la metodología GitFlow y Subversion.",
            "Despliegue de aplicaciones en entornos de desarrollo y preproducción (Jenkins, JBOSS)."
          ]
        },
        {
          "company": "Advantic Consultores",
          "position": "Desarrollador Java Full-Stack",
          "period": "Mayo 2022 - Abril 2024",
          "description": "Desarrollador Java Full-Stack con sólida experiencia en el desarrollo y personalización de soluciones empresariales. Llevé a cabo la implementación y adaptación de una aplicación crítica para la gestión de inspecciones técnicas de vehículos (ITV) en múltiples estaciones, optimizando los procesos y mejorando la eficiencia.",
          "tasks": [
            "Análisis, diseño y desarrollo de funcionalidades personalizadas, asegurando la alineación con los requisitos del negocio.",
            "Mantenimiento de aplicaciones existentes, realizando actualizaciones y mejoras continuas para asegurar su correcto funcionamiento y adaptarlas a nuevas necesidades.",
            "Integración de la aplicación con otros sistemas (Ekon ERP, Servicios SOAP y REST) y bases de datos, garantizando una fluida comunicación entre los diferentes componentes.",
            "Despliegue de aplicaciones en entornos de producción.",
            "Resolución de incidencias y soporte técnico a usuarios finales, asegurando la estabilidad y disponibilidad de las aplicaciones.",
            "Colaboración en equipos ágiles, participando activamente en todas las fases del desarrollo, desde la planificación hasta la entrega.",
            "Mentoría y capacitación de otros miembros del equipo, promoviendo el conocimiento compartido y el crecimiento profesional. En particular, me he dedicado a la práctica de pair programming para facilitar la transferencia de conocimientos y mejorar la calidad del código.",
            "Impartición de una formación en Git y GitHub para todo el equipo, lo que permitió mejorar la colaboración y el control de versiones."
          ]
        }
      ]
    },
    "projects": {
      "title": "Proyectos Personales",
      "list": [
        {
          "name": "SportKing",
          "description": "Aplicación para gestionar la reserva de pistas de diferentes deportes en distintos horarios disponibles. Cuenta con gestión de usuarios y roles. Esta aplicación fue un proyecto enriquecedor que me permitió aprender y aplicar conceptos clave del desarrollo de software, especialmente en lo que respecta a la gestión de proyectos y la resolución de problemas.",
          "details": [
            "Aprendí mucho sobre seguridad y protocolos como JWT.",
            "Me ayudó a iniciarme en el mundo de las API REST y en los Frameworks de JavaScript."
          ],
          "links": [
            {
              "text": "Backend Repository",
              "url": "https://github.com/Javi3rHR/SportKing_Backend"
            },
            {
              "text": "Frontend Repository",
              "url": "https://github.com/Javi3rHR/SportKing_Frontend"
            }
          ]
        }
      ]
    },
    "education": {
      "title": "Educación",
      "schools": [
        {
          "name": "I.E.S Virrey Morcillo",
          "period": "2020-2022",
          "degree": "Ciclo Formativo de Grado Superior",
          "field": "Desarrollo de aplicaciones Web"
        }
      ]
    },
    "footer": {
      "copyright": "© 2024 Javier Herreros Rodríguez. Todos los derechos reservados.",
      "languages": {
        "title": "Idiomas",
        "list": [
          {
            "language": "Español",
            "level": "Nativo"
          },
          {
            "language": "Inglés",
            "level": "Básico"
          }
        ]
      }
    }
  },
  "en": {
    "header": {
      "name": "Javier Herreros Rodríguez",
      "title": "Full-Stack Java Developer",
      "location": "Albacete - Spain",
      "downloadCV": "Download CV"
    },
    "about": {
      "title": "About Me",
      "description": "Full-Stack Java Developer with solid experience in the development and customization of business solutions. I have worked on the implementation and adaptation of critical applications that optimize processes and improve efficiency. Specialized in Java (Spring Boot, JPA) and SQL (Oracle, SQL Server), with experience in frontend technologies (React, Angular). Committed to implementing clean architectures and test-driven development practices. I enjoy sharing my knowledge and supporting junior developers in their professional growth."
    },
    "skills": {
      "title": "My Skills",
      "list": [
        "Java",
        "Spring Boot",
        "JPA",
        "SQL (Oracle, SQL Server)",
        "React",
        "Angular",
        "Clean Architecture",
        "TDD",
        "Git",
        "Scrum",
        "Kanban",
        "XP",
        "Jenkins",
        "JBOSS",
        "JUnit",
        "Mockito",
        "REST",
        "SOAP"
      ]
    },
    "experience": {
      "title": "Professional Experience",
      "jobs": [
        {
          "company": "NTT DATA Europe & Latam",
          "position": "Full-Stack Java Developer",
          "period": "April 2024 - Present",
          "description": "Full-Stack Java Developer with experience in the design and development of technological solutions for the public sector (Justice). I have participated in the implementation and adaptation of critical applications that optimize judicial processes, improving efficiency and transparency in information management.",
          "tasks": [
            "Analysis, design, and development of custom features, ensuring alignment with business requirements.",
            "Development and maintenance of databases (Oracle SQL, SQL Developer, PL/SQL, DBeaver).",
            "Incident resolution and technical support for end users, ensuring application stability and availability (Jira).",
            "Supporting colleagues and junior developers, promoting learning and collaboration within the team.",
            "Collaboration in agile teams, actively participating in all phases of development, from planning to delivery (Scrum, Kanban, XP).",
            "Using task management tools like Jira, Notion, Microsoft Teams, and SharePoint for project coordination and tracking.",
            "Implementation of unit and integration tests to ensure software quality (JUnit, Mockito).",
            "Version control management, providing training to colleagues on the use of Git, GitHub, GitFlow methodology, and Subversion.",
            "Deployment of applications in development and pre-production environments (Jenkins, JBOSS)."
          ]
        },
        {
          "company": "Advantic Consultores",
          "position": "Full-Stack Java Developer",
          "period": "May 2022 - April 2024",
          "description": "Full-Stack Java Developer with solid experience in the development and customization of business solutions. I carried out the implementation and adaptation of a critical application for the management of vehicle technical inspections (ITV) at multiple stations, optimizing processes and improving efficiency.",
          "tasks": [
            "Analysis, design, and development of custom features, ensuring alignment with business requirements.",
            "Maintenance of existing applications, performing updates and continuous improvements to ensure their proper functioning and adapt to new needs.",
            "Integration of the application with other systems (Ekon ERP, SOAP and REST services) and databases, ensuring smooth communication between different components.",
            "Deployment of applications in production environments.",
            "Incident resolution and technical support for end users, ensuring application stability and availability.",
            "Collaboration in agile teams, actively participating in all phases of development, from planning to delivery.",
            "Mentoring and training other team members, promoting knowledge sharing and professional growth. I have particularly focused on pair programming to facilitate knowledge transfer and improve code quality.",
            "Conducted training on Git and GitHub for the entire team, improving collaboration and version control."
          ]
        }
      ]
    },
    "projects": {
      "title": "Personal Projects",
      "list": [
        {
          "name": "SportKing",
          "description": "Application to manage the reservation of sports courts at different available times. It includes user and role management. This application was an enriching project that allowed me to learn and apply key software development concepts, especially in project management and problem-solving.",
          "details": [
            "I learned a lot about security and protocols like JWT.",
            "It helped me get started with the world of REST APIs and JavaScript frameworks."
          ],
          "links": [
            {
              "text": "Backend Repository",
              "url": "https://github.com/Javi3rHR/SportKing_Backend"
            },
            {
              "text": "Frontend Repository",
              "url": "https://github.com/Javi3rHR/SportKing_Frontend"
            }
          ]
        }
      ]
    },
    "education": {
      "title": "Education",
      "schools": [
        {
          "name": "I.E.S Virrey Morcillo",
          "period": "2020-2022",
          "degree": "Advanced Vocational Training",
          "field": "Web Application Development"
        }
      ]
    },
    "footer": {
      "copyright": "© 2024 Javier Herreros Rodríguez. All rights reserved.",
      "languages": {
        "title": "Languages",
        "list": [
          {
            "language": "Spanish",
            "level": "Native"
          },
          {
            "language": "English",
            "level": "Basic"
          }
        ]
      }
    }
  }
}
